Repository: DeyanShahov/CoordinateTrackerAndClicker
Catalog: Resources/Strings.*.resx
Languages: de, fr

# btnStartRecording
source: Start recording
de: Aufnahme starten
fr: Démarrer l'enregistrement

# btnStopRecording
source: Stop recording
de: Aufnahme stoppen
fr: Arrêter l'enregistrement

# CurrentPositionLabel
source: Current position:
de: Aktuelle position:
fr: Position actuelle:

# LastClickLabel
source: Last click:
de: Letzter кlick:
fr: Dernier clic:

# Form2
source: Automatic Clicker
de: Automatischer Klicker
fr: Cliqueur Automatique

# tabPage1
source: Login
de: Anmeldung
fr: Connexion

# tabPage2
source: Create Мacro
de: Makro erstellen
fr: Créer une Мacro

# tabPage3
source: Use
de: Verwenden
fr: Utiliser

# tabPage4
source: Settings
de: Einstellungen
fr: Paramètres

# txtX
source: X coordinate
de: X Koordinat
fr: Coordonnée X

# txtY
source: Y coordinate
de: Y Koordinate
fr: Coordonnée Y

# cmbActionType
source: Single click, Double click, Scrollin, Right-click
de: Einfacher Klick, Doppelklick, Scrollen, Rechtsklick
fr: Clic simple, Clic double, Défilement, Clic droit

# chkReturnMouseToOriginal
source: Return to the original position
de: Zurückkehren zur ursprünglichen Position
fr: Retour à la position d'origine

# FrequencyInputSliderLabel
source: Frequency (seconds)
de: Frequenz (Sekunden)
fr: Fréquence (secondes)

# DurationInputSliderLabel
source: Duration (minutes)
de: Dauer (Minuten)
fr: Durée (minutes)

# CountInputSliderLabel
source: Repetitions
de: Wiederholungen
fr: Répétitions

# countAllMacroRepeatSliderLabel
source: Repetitions
de: Wiederholungen
fr: Répétitions

# textBoxMacroNameHint
source: Enter a name for the macro
de: Geben Sie einen Namen für das Makro ein
fr: Entrez un nom pour le macro

# textBoxMacroNameText
source: Macro 1
de: Makro 1

# textBoxActionNameHint
source: Enter a name for the action
de: Geben Sie einen Namen für die Aktion ein
fr: Entrez un nom pour l'action

# textBoxActionNameText
source: Action 1
de: Aktion 1

# numericDelayBeforeSliderLabel
source: Delay before (ms)
de: Verzögerung vor (ms)
fr: Délai avant (ms)

# numericDelaySliderLabel
source: Delay after (ms)
de: Verzögerung nach (ms)
fr: Délai après (ms)

# btnAddAction
source: Add as new action
de: Als neue Aktion hinzufügen
fr: Ajouter en tant que nouvelle action

# btnCreateMacro
source: Create a new macro
de: Neues Makro erstellen
fr: Créer un nouveau macro

# btnMacroSave
source: Save
de: Speichern
fr: Sauvegarder

# btnMacroDelete
source: Delete
de: Löschen
fr: Supprimer

# btnNewSavePath
source: Location
de: Standort
fr: Emplacement

# textBoxDisplayMacroInfo
source: Macro information . . .
de: Makro-Informationen . . .
fr: Informations sur le macro . . .

# chkAllMacrosToExecute
source: Execute all
de: Alle ausführen
fr: Exécuter tout

# btnExecuteMacro
source: Execute
de: Ausführen
fr: Exécuter

# btnStopMacro
source: Stop
de: Stoppen
fr: Arrêter

# richTextBoxLogInfo
source: History . . .
de: Verlauf . . .
fr: Historique . . .

# groupBoxTheme
source: Theme
de: Thema
fr: Thème

# materialLabelTheme
source: Dark
de: Dunkel
fr: Sombre

# btnSwitchTheme
source: Light
de: Hell
fr: Claire

# groupBoxCollors
source: Color variations
de: Farbvarianten
fr: Variations de couleurs

# RadioButtonGreen
source: Green
de: Grün
fr: Vert

# RadioButtonBlue
source: Blue
de: Blau
fr: Bleu

# RadioButtonBase
source: Base
de: Basis
fr: De base

# groupBoxLanguages
source: Language packs
de: Sprachpakete
fr: Packs de langue

# RadioButtonLanguageBG
source: Bulgarian
de: Bulgarisch
fr: Bulgare

# RadioButtonLanguageEN
source: English
de: Englisch
fr: Anglais

# RadioButtonLanguageDE
source: German
de: Deutsch
fr: Allemand

# RadioButtonLanguageFR
source: French
de: Französisch
fr: Français

# groupBoxAllert
source: Modal windows
de: Modale Fenster
fr: Fenêtres modales

# materialLabelAllert
source: Stop
de: Stoppen
fr: Arrêter

# BtnSwitchModalAlert
source: Running
de: Ausgeführt
fr: Lancé

# CheckboxError
source: Errors
de: Fehler
fr: Erreurs

# CheckboxSuccess
source: Successes
de: Erfolge
fr: Succès

# START_BUTTON_OK
source: Tracking coordinates in progress . . .
de: Koordinatenverfolgung im Gange . . .
fr: Suivi des coordonnées en cours . . .

# STOP_BUTTON_NO_RECORD
source: No coordinates recorded.
de: Keine Koordinaten gespeichert.
fr: Aucune coordonnée enregistrée.

# STOP_BUTTON_OK_RECORD
source: Loaded coordinates for action.
de: Geladene Koordinaten für Aktion.
fr: Coordonnées chargées pour l'action.

# ON_GLOBAL_MOUSE_CLICK
source: New coordinates detected.
de: Neue Koordinaten erfasst.
fr: Nouvelles coordonnées détectées.

# BTN_ADD_ACTION_NO_RECORD
source: No coordinates recorded in the fields.
de: Keine Koordinaten in den Feldern gespeichert.
fr: Aucune coordonnée enregistrée dans les champs.

# BTN_ADD_ACTION_OK
source: Successfully added to the action list.
de: Erfolgreich zur Aktionsliste hinzugefügt.
fr: Ajouté avec succès à la liste des actions.

# BTN_CREATE_MACRO_OK
source: Successfully added to the available macros.
de: Erfolgreich zu den verfügbaren Makros hinzugefügt.
fr: Ajouté avec succès aux macros disponibles.

# LST_AVEILABLE_MACROS_FULL
source: The macro list is full.
de: Die Makroliste ist voll.
fr: La liste des macros est pleine.

# BTN_EXECUTE_MACRO_START
source: Automatic clicking in progress . . .
de: Automatisches Klicken läuft . . .
fr: Clic automatique en cours . . .

# BTN_EXECUTE_MACRO_MISSING_MACRO
source: No such macro to execute.
de: Kein solches Makro zum Ausführen.
fr: Aucun macro à exécuter.

# BTN_EXECUTE_MACRO_FINISH
source: Automatic clicking has ended.
de: Das automatische Klicken ist beendet
fr: Le clic automatique est terminé.

# BTN_STOP_MACRO
source: The automatic clicking was stopped.
de: Das automatische Klicken wurde gestoppt.
fr: Le clic automatique a été arrêté.

# BTN_ACTION_DELETE_OK_REMOVE
source: Action removed from the add list.
de: Aktion aus der Hinzufügungsliste entfernt.
fr: Action supprimée de la liste d'ajout.

# BTN_MACRO_FOR_EXECUTE_DELETE_OK_REMOVE
source: Macro removed from the execution list.
de: Makro aus der Ausführungsliste entfernt.
fr: Macro supprimé de la liste d'exécution.

# CHK_ALL_MACROS_TO_EXECUTE_ALL
source: All macros in the list are for execution.
de: Alle Makros in der Liste sind zur Ausführung.
fr: Tous les macros de la liste sont à exécuter.

# CHK_ALL_MACROS_TO_EXECUTE_SINGLE
source: Only the selected macro will be executed.
de: Nur das ausgewählte Makro wird ausgeführt.
fr: Seul le macro sélectionné sera exécuté.

# IS_NAME_INVALID
source: Invalid name.
de: Ungültiger Name.
fr: Nom invalide.

# IS_LIST_EMPTY
source: No items in the list.
de: Keine Elemente in der Liste.
fr: Aucun élément dans la liste.

# IS_NOTING_SELECTED_IN_LIST
source: No item selected from the list.
de: Kein Element aus der Liste ausgewählt.
fr: Aucun élément sélectionné dans la liste

source: Success
de: Erfolg
fr: Succès

source: Error
de: Fehler
fr: Erreur

# INITIALIZE_BUTTONS_BEHAVIOR_ERROR
source: Error adding behavior to the buttons.
de: Fehler beim Hinzufügen des Verhaltens zu den Tasten.
fr: Erreur lors de l'ajout du comportement aux boutons.

# LOAD_SAVED_MACROS_BASE_DIRECTORY
source: Base directory of the application
de: Basisverzeichnis der Anwendung
fr: Répertoire de base de l'application

# LOAD_SAVED_MACROS_PATH_TO_SAVE
source: Path to the file with records
de: Pfad zur Datei mit den Aufzeichnungen
fr: Chemin vers le fichier avec les enregistrements

# LOAD_SAVED_MACROS_LOADING
source: Loading macros . . .
de: Laden von Makros . . .
fr: Chargement des macros . . .

# LOAD_SAVED_MACROS_LOADED
source: The macros are loaded.
de: Die Makros sind geladen.
fr: Les macros sont chargées.

# LOAD_SAVED_MACROS_LIST_EMPTY
source: The list is empty and no macros are saved.
de: Die Liste ist leer und keine Makros sind gespeichert.
fr: La liste est vide et aucun macro n'est enregistré.

# BTN_MACRO_SAVE_TO_DB_NO_SELECTED
source: No macro selected.
de: Kein Makro ausgewählt.
fr: Aucun macro sélectionné.

# BTN_MACRO_SAVE_TO_DB_ERROR_DIR_OR_FILE
source: Problem with the directory or file for saving.
de: Problem mit dem Verzeichnis oder der Datei zum Speichern.
fr: Problème avec le répertoire ou le fichier de sauvegarde.

# BTN_MACRO_SAVE_TO_DB_OK
source: Successful save to the archive.
de: Erfolgreiche Speicherung im Archiv.
fr: Enregistrement réussi dans l'archive.

# BTN_MACRO_SAVE_TO_DB_M_EXISTS_OR_ERROR
source: There is such a macro in the archive or an error occurred during the save.
de: Ein solches Makro befindet sich im Archiv oder es ist ein Fehler beim Speichern aufgetreten.
fr: Il existe un tel macro dans l'archive ou une erreur s'est produite lors de l'enregistrement.

# BTN_MACRO_DELETE_FROM_DB_NO_SELECTED
source: No macro selected.
de: Kein Makro ausgewählt.
fr: Aucun macro sélectionné.

# BTN_MACRO_DELETE_FROM_DB_ERROR_DIR_OR_FILE
source: Problem with the directory or file for saving.
de: Problem mit dem Verzeichnis oder der Datei zum Speichern.
fr: Problème avec le répertoire ou le fichier de sauvegarde.

# BTN_MACRO_DELETE_FROM_DB_ERROR_REQUEST
source: Unsuccessful request
de: Fehlgeschlagene Anfrage.
fr: Demande échouée.

# BTN_MACRO_DELETE_FROM_DB_OK
source: Successful delete.
de: Erfolgreiches Löschen.
fr: Suppression réussie.

# CREATE_MACRO_NAME_EXIST
source: A macro with this name already exists.
de: Ein Makro mit diesem Namen existiert bereits.
fr: Un macro avec ce nom existe déjà.

# EXECUTE_MACRO_ASYNC_REPETITIONS
source: Repetitions
de: Wiederholungen
fr: Répétitions

# EXECUTE_MACRO_ASYNC_DURATION
source: Duration
de: Dauer
fr: Durée

# EXECUTE_MACRO_ASYNC_EXPECTED_DURATION
source: Expected duration
de: Erwartete Dauer
fr: Durée attendue

# EXECUTE_MACRO_ASYNC_REPETITION
source: Global repetition
de: Globale Wiederholung
fr: Répétition globale

# EXECUTE_MACRO_ASYNC_STARTED
source: Macro started
de: Makro gestartet
fr: Macro démarré

# EXECUTE_MACRO_ASYNC_MACRO_REPETITION
source: Macro repetition
de: Makro-Wiederholung
fr: Répétition de macro

# EXECUTE_MACRO_ASYNC_ACTION_STARTED
source: Action started
de: Aktion gestartet
fr: Action démarrée

# EXECUTE_MACRO_ASYNC_ACTION_REPETITION
source: Action repetition
de: Aktion Wiederholung
fr: Répétition d'action

# EXECUTE_MACRO_ASYNC_REMAIN_TIME
source: Remaining time
de: Verbleibende Zeit
fr: Temps restant

# EXECUTE_MACRO_ASYNC_END_AFTER
source: End after
de: Ende nach
fr: Fin après

# EXECUTE_MACRO_ASYNC_ACTION_PROGRESS
source: Action progress
de: Aktionsfortschritt
fr: Progression de l'action

# EXECUTE_MACRO_ASYNC_MACRO_PROGRESS
source: Macro progress
de: Makro-Fortschritt
fr: Progression des macros

# EXECUTE_MACRO_ASYNC_MACRO_COMPLETED
source: The macro is completed.
de: Das Makro ist abgeschlossen.
fr: Le macro est terminé.

# EXECUTE_MACRO_ASYNC_MACRO_INTERRUPTED
source: The macro was interrupted.
de: Das Makro wurde unterbrochen.
fr: Le macro a été interrompu.

# SET_SAVE_DIRECTORY
source: Select a directory to save macros.
de: Wählen Sie ein Verzeichnis zum Speichern von Makros aus.
fr: Sélectionnez un répertoire pour enregistrer les macros.

# ADD_NEW_BUTTON_ERROR
source: The key already exists in the collection. The action is skipped.
de: Der Schlüssel existiert bereits in der Sammlung. Die Aktion wird übersprungen.
fr: La clé existe déjà dans la collection. L'action est ignorée.

# CLICK_BUTTON_MECHANICS_EXECUTE_ERROR
source: The provided key does not exist in the collection.
de: Der bereitgestellte Schlüssel existiert nicht in der Sammlung.
fr: La clé fournie n'existe pas dans la collection.

# CHECK_FOR_NULL
source: The sender cannot be empty
de: Der Absender darf nicht leer sein.
fr: L'expéditeur ne peut pas être vide.

# DISPLAY_ACTION_INFO_CORDINATES
source: Coordinates
de: Koordinaten
fr: Coordonnées

# DISPLAY_ACTION_INFO_ACTION
source: Action
de: Aktion

# DISPLAY_ACTION_INFO_BEFORE
source: Delay before
de: Verzögerung vor
fr: Délai avant

# DISPLAY_ACTION_INFO_AFTER
source: Delay after
de: Verzögerung nach
fr: Délai après

# DISPLAY_ACTION_INFO_FREQUENCY
source: Frequency
de: Häufigkeit
fr: Fréquence

# DISPLAY_MACRO_INFO
source: Saved in the archive.
de: Im Archiv gespeichert.
fr: Sauvegardé dans l'archive.

# DISPLAY_ACTION_INFO_ORIGINAL_POSITION
source: Original position
fr: Position d'origine
